IDENTIFICATION DIVISION.
       PROGRAM-ID. EMPLOYEE-RECORDS-SYSTEM.
       DATE-COMPILED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE-MASTER-FILE
               ASSIGN TO "EMPMAS.DAT"
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-MASTER-STATUS.

           SELECT TRANSACTION-FILE
               ASSIGN TO "TRANS.DAT"
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-TRANS-STATUS.

           SELECT NEW-EMPLOYEE-FILE
               ASSIGN TO "NEWEMP.DAT"
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-NEW-EMP-STATUS.

           SELECT PAYROLL-REPORT-FILE
               ASSIGN TO "PAYROLL.RPT"
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-REPORT-STATUS.

           SELECT ERROR-LOG-FILE
               ASSIGN TO "ERROR.LOG"
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS WS-ERROR-STATUS.

       DATA DIVISION.
       FILE SECTION.